# RebarInvalidDiameterRemoved Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..RebarInvalidDiameterRemoved Property
BuiltInFailures..::..RebarFailures Class See Also
---
Invalid RebarBarType was removed on upgrade.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarInvalidDiameterRemoved { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarInvalidDiameterRemoved As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarInvalidDiameterRemoved {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace